{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "filters": 21, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "filters": 21, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_10", 0, 0], ["conv2d_13", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3", "group1-shard2of3", "group1-shard3of3"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [16], "dtype": "float32", "quantization": {"min": 1.1806584596633911, "scale": 0.020395441148795334, "dtype": "uint8"}}, {"name": "batch_normalization_1/beta", "shape": [16], "dtype": "float32", "quantization": {"min": -9.951572220933203, "scale": 0.044033505402359306, "dtype": "uint8"}}, {"name": "batch_normalization_1/moving_mean", "shape": [16], "dtype": "float32", "quantization": {"min": -1.6358825945386701, "scale": 0.008346339768054439, "dtype": "uint8"}}, {"name": "batch_normalization_1/moving_variance", "shape": [16], "dtype": "float32", "quantization": {"min": 0.006857528816908598, "scale": 0.005637768614014574, "dtype": "uint8"}}, {"name": "batch_normalization_10/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.91201251745224, "scale": 0.0025160810526679545, "dtype": "uint8"}}, {"name": "batch_normalization_10/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -0.5993773899826349, "scale": 0.006514971630246031, "dtype": "uint8"}}, {"name": "batch_normalization_10/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -0.603004067551856, "scale": 0.004638492827321969, "dtype": "uint8"}}, {"name": "batch_normalization_10/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 0.10996297001838684, "scale": 0.007593403493656832, "dtype": "uint8"}}, {"name": "batch_normalization_11/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.42451900243759155, "scale": 0.006374925024369184, "dtype": "uint8"}}, {"name": "batch_normalization_11/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -0.985959030600155, "scale": 0.007825071671429802, "dtype": "uint8"}}, {"name": "batch_normalization_11/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -4.218289940029967, "scale": 0.036364568448534196, "dtype": "uint8"}}, {"name": "batch_normalization_11/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 2.0791501998901367, "scale": 0.4487292906817268, "dtype": "uint8"}}, {"name": "batch_normalization_2/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 1.1214892864227295, "scale": 0.022397934221753887, "dtype": "uint8"}}, {"name": "batch_normalization_2/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -1.9547647728639492, "scale": 0.014479739058251475, "dtype": "uint8"}}, {"name": "batch_normalization_2/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -13.82630303326775, "scale": 0.08482394498937271, "dtype": "uint8"}}, {"name": "batch_normalization_2/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 12.669628143310547, "scale": 0.8438151789646523, "dtype": "uint8"}}, {"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 1.0527108907699585, "scale": 0.015023583524367388, "dtype": "uint8"}}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -5.441195431877586, "scale": 0.03317802092608284, "dtype": "uint8"}}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -14.755352861741011, "scale": 0.08942638098024855, "dtype": "uint8"}}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 5.999964714050293, "scale": 0.20475102218927121, "dtype": "uint8"}}, {"name": "batch_normalization_4/gamma", "shape": [128], "dtype": "float32", "quantization": {"min": 0.9169877767562866, "scale": 0.014462452776291792, "dtype": "uint8"}}, {"name": "batch_normalization_4/beta", "shape": [128], "dtype": "float32", "quantization": {"min": -5.405808273016238, "scale": 0.024133072647393918, "dtype": "uint8"}}, {"name": "batch_normalization_4/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"min": -11.537922999438118, "scale": 0.07443821289960076, "dtype": "uint8"}}, {"name": "batch_normalization_4/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"min": 6.0124359130859375, "scale": 0.12567898619408702, "dtype": "uint8"}}, {"name": "batch_normalization_5/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 1.135922908782959, "scale": 0.008018092548145967, "dtype": "uint8"}}, {"name": "batch_normalization_5/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -5.269452983725304, "scale": 0.021247794289214937, "dtype": "uint8"}}, {"name": "batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -8.43334477742513, "scale": 0.06155726114908854, "dtype": "uint8"}}, {"name": "batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 3.2873525619506836, "scale": 0.22499542610318052, "dtype": "uint8"}}, {"name": "batch_normalization_6/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.6900724768638611, "scale": 0.0069259075557484345, "dtype": "uint8"}}, {"name": "batch_normalization_6/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -5.286240795079399, "scale": 0.023811895473330628, "dtype": "uint8"}}, {"name": "batch_normalization_6/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -4.333974494186102, "scale": 0.029283611447203393, "dtype": "uint8"}}, {"name": "batch_normalization_6/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 1.4544490575790405, "scale": 0.39886428094377707, "dtype": "uint8"}}, {"name": "batch_normalization_7/gamma", "shape": [1024], "dtype": "float32", "quantization": {"min": 2.9722740650177, "scale": 0.018988931880277747, "dtype": "uint8"}}, {"name": "batch_normalization_7/beta", "shape": [1024], "dtype": "float32", "quantization": {"min": -5.95696496963501, "scale": 0.01725016575233609, "dtype": "uint8"}}, {"name": "batch_normalization_7/moving_mean", "shape": [1024], "dtype": "float32", "quantization": {"min": -3.815166362126668, "scale": 0.02131377855936686, "dtype": "uint8"}}, {"name": "batch_normalization_7/moving_variance", "shape": [1024], "dtype": "float32", "quantization": {"min": 0.27171239256858826, "scale": 0.05416630728572023, "dtype": "uint8"}}, {"name": "batch_normalization_8/gamma", "shape": [256], "dtype": "float32", "quantization": {"min": 0.5855805277824402, "scale": 0.003420113348493389, "dtype": "uint8"}}, {"name": "batch_normalization_8/beta", "shape": [256], "dtype": "float32", "quantization": {"min": -1.2587280631065367, "scale": 0.00711145798365275, "dtype": "uint8"}}, {"name": "batch_normalization_8/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"min": -5.155472570307115, "scale": 0.046445698831595626, "dtype": "uint8"}}, {"name": "batch_normalization_8/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"min": 18.498916625976562, "scale": 4.700855868470435, "dtype": "uint8"}}, {"name": "batch_normalization_9/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.4727243185043335, "scale": 0.005035764563317393, "dtype": "uint8"}}, {"name": "batch_normalization_9/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.7451745313756607, "scale": 0.005561003965490005, "dtype": "uint8"}}, {"name": "batch_normalization_9/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -3.3474169375849705, "scale": 0.020044412799910004, "dtype": "uint8"}}, {"name": "batch_normalization_9/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 0.26239627599716187, "scale": 0.10305503980786193, "dtype": "uint8"}}, {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32", "quantization": {"min": -2.2980442944694968, "scale": 0.018094836964326746, "dtype": "uint8"}}, {"name": "conv2d_10/kernel", "shape": [1, 1, 512, 21], "dtype": "float32", "quantization": {"min": -0.7781125629649442, "scale": 0.0061754965314678115, "dtype": "uint8"}}, {"name": "conv2d_10/bias", "shape": [21], "dtype": "float32", "quantization": {"min": -0.9936490825578278, "scale": 0.00776288345748303, "dtype": "uint8"}}, {"name": "conv2d_11/kernel", "shape": [1, 1, 256, 128], "dtype": "float32", "quantization": {"min": -0.32051997605492083, "scale": 0.002967777556064082, "dtype": "uint8"}}, {"name": "conv2d_12/kernel", "shape": [3, 3, 384, 256], "dtype": "float32", "quantization": {"min": -0.1751208045903374, "scale": 0.0013266727620480107, "dtype": "uint8"}}, {"name": "conv2d_13/kernel", "shape": [1, 1, 256, 21], "dtype": "float32", "quantization": {"min": -0.3145352987682118, "scale": 0.0022792412954218246, "dtype": "uint8"}}, {"name": "conv2d_13/bias", "shape": [21], "dtype": "float32", "quantization": {"min": -0.9417020068449132, "scale": 0.007134106112461464, "dtype": "uint8"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"min": -1.5550881133360022, "scale": 0.011519171209896312, "dtype": "uint8"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"min": -1.248800998575547, "scale": 0.01125045944662655, "dtype": "uint8"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.6229795661627078, "scale": 0.006557679643817977, "dtype": "uint8"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"min": -0.3994909361297009, "scale": 0.004539669728746601, "dtype": "uint8"}}, {"name": "conv2d_6/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"min": -0.23157936147615021, "scale": 0.0031294508307587866, "dtype": "uint8"}}, {"name": "conv2d_7/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32", "quantization": {"min": -0.5213647709173315, "scale": 0.003121944736031925, "dtype": "uint8"}}, {"name": "conv2d_8/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32", "quantization": {"min": -0.409724769522162, "scale": 0.004936443006291109, "dtype": "uint8"}}, {"name": "conv2d_9/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"min": -0.3914663539213293, "scale": 0.0026630364212335326, "dtype": "uint8"}}]}]}